#### AssemblyCodeTable Class

---

|  |
| --- |
| Members   See Also |

AssemblyCodeTable represents the collection of ClassificationEntries for a document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public class AssemblyCodeTable : KeyBasedTreeEntryTable ``` |

| Visual Basic |
| --- |
| ``` Public Class AssemblyCodeTable _ 	Inherits KeyBasedTreeEntryTable ``` |

| Visual C++ |
| --- |
| ``` public ref class AssemblyCodeTable : public KeyBasedTreeEntryTable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB KeyBasedTreeEntryTable
  Autodesk.Revit.DB AssemblyCodeTable

# See Also

AssemblyCodeTable Members

Autodesk.Revit.DB Namespace